W8D1-project/benchbnb/app/models/user.rb

  def reset_session_token
    self.session_token = SecureRandom::urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "bsJFnzL9E01mmqmqhOjuWQ"], ["updated_at", "2018-10-08 18:00:32.642357"], ["id", 1]]

  def self.find_by_credentials(uname, pword)
    user = User.find_by(username: uname)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "matt"], ["LIMIT", 1]]